Revit 2027 API
FieldDomainPointsByUV(IList<UV>, ICollection<Double>, ICollection<Double>) Constructor
 Creates object from an array of two-dimensional point coordinates
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldDomainPointsByUV(
	IList<UV> points,
	ICollection<double> uCoordinates,
	ICollection<double> vCoordinates
)
Public Sub New (
	points As IList(Of UV),
	uCoordinates As ICollection(Of Double),
	vCoordinates As ICollection(Of Double)
)
public:
FieldDomainPointsByUV(
	IList<UV^>^ points,
	ICollection<double>^ uCoordinates,
	ICollection<double>^ vCoordinates
)
new :
        points : IList<UV> *
        uCoordinates : ICollection<float> *
        vCoordinates : ICollection<float> -> FieldDomainPointsByUV
Parameters
points IList<UV>
 Array of two-dimensional point coordinates representing domain points (usually on surface)
uCoordinates ICollection<Double>
 Set of u coordinates at which to draw grid lines on the surface
vCoordinates ICollection<Double>
 Set of v coordinates at which to draw grid lines on the surface
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldDomainPointsByUV Class
FieldDomainPointsByUV Overload
Autodesk.Revit.DB.Analysis Namespace